[{"content":"","date":1580656493,"description":"","lastmod":"2020-02-02T15:14:53Z","objectID":"5f1afa4d391b5d001d2d3ffb8556b037","permalink":"https://example.com/reseau/ip/","publishdate":"2020-02-02T15:14:53Z","title":"IP"},{"content":"La somme de contrôle (Hash) La version basique d’un tel mécanisme est appelée “somme de contrôle”.\nLe but d’une somme de contrôle est en quelque sorte d’être “l’empreinte” d’une donnée (attention, cette “empreinte” n’est pas une signature et ne garantit pas pour autant l’identité). Un exemple très simplifié serait de compter le nombre de lettres dans un message et de rajouter ce nombre à la fin dudit message. De cette manière, un destinataire peut immédiatement vérifier que le message n’a pas été coupé par erreur.\nUn mécanisme de ce type, bien qu’un peu plus complexe, est utilisé pour vérifier votre numéro de compte IBAN. Les deux derniers chiffres sont en effet une somme de contrôle (selon un algorithme un peu compliqué à résumer) des chiffres précédents. Un mécanisme similaire est appliqué aux cartes de crédit. Cela signifie que si vous entrez un mauvais chiffre par erreur lors d’un paiement, votre banque en ligne le détectera immédiatement. Bien entendu, ces systèmes sont simples et ne permettent que de détecter des erreurs involontaires.\nLes algorithmes de hashage C’est pour cela qu’ont été développés les algorithmes de “hashage”, littéralement qui mixent, mélangent les données. Les plus connus sont aujourd’hui la famille de fonctions SHA-2 et SHA-3.\nLe principe d’un algorithme de hashage est de générer, pour n’importe quelle information de n’importe quelle taille, une empreinte unique. Voici par exemple le hash SHA-2 256 bits d’un fichier sur mon ordinateur :\n9eb4ef548e36a589a46ef00395f3e2f722f5466438c9385976ab188bec59fa2d\n4 propriétés fondamentales Cette empreinte, ou plutôt ce hash, possède plusieurs propriétés particulièrement intéressantes.\nPremièrement, elle est “déterministe”. Cela signifie que si je prends le même fichier, j’aurai toujours une seule et même empreinte unique.\nEn deuxième lieu, elle est “chaotique”. Ça veut dire que si je change même très légèrement la donnée initiale, l’empreinte sera complètement différente. Voici par exemple le hash du …","date":1580656493,"description":"","lastmod":"2020-02-02T15:14:53Z","objectID":"808adb83d0bef1e164bed38bb07f91fc","permalink":"https://example.com/system/hash/","publishdate":"2020-02-02T15:14:53Z","title":"Hash"},{"content":"La base de registre est un élément fondamental du système. C\u0026amp;rsquo;est une gigantesque base de données qui peut atteindre plusieurs dizaines de méga. Afin de faciliter la gestion de cette base, celle ci est organisée en 5 clés principales, elles mêmes divisées en sous clés.\nLes 5 clés et leurs fonctions HKEY_CLASS_ROOT : Cette clé gère les extensions des fichiers ainsi que les liaisons avec les logiciels et serveurs ActiveX. Toutes les extensions des fichiers et leur programme correspondant sont gérés ici. Lorsque vous cliquez sur un document ayant une extension .xls par exemple, Windows saura qu\u0026amp;rsquo;il devra charger Excel pour ouvrir le fichier.\nCertains menus contextuels sont également gérés ici, de même que les composants communs de Windows et les Dll et Exe Active X, les contrôles complémentaires, etc. Si les inscriptions de ces composants sont modifiés, vous pouvez au pire en plus pouvoir vous servir du programme qui en a besoin.\n/CLSID : Gestion des identificateurs de classe des objets COM\n/Extension : Cette clé gère les extensions de fichiers. Certaines extensions ne figurent cependant pas dans cette clé, il faut alors regarder du côté du type de fichier\n/Applications : Cette clé gère certains menus contextuels.\n/Directory : Clé gérant les menus contextuels du bouton démarrer.\n/Drive : Gestion des menus contextuels des lecteurs.\n/Folder : Icône et menus contextuels des dossiers\nHKEY_CURRENT_USER : Cette clé contient toutes les informations de l\u0026amp;rsquo;utilisateur connecté (celui qui utilise le PC) : paramètres des dossiers et couleurs d\u0026amp;rsquo;écran et du panneau de configuration. C\u0026amp;rsquo;est une sous clé de HKEY_USERS\n/AppEvents : Cette clé contient les événements systèmes et leurs sons correspondants (allez jeter un oeil dans le panneau de configuration \u0026amp;gt; sons et périphériques audio \u0026amp;gt; sons)\n/EventLabels : Ce sont les événements système.\n/ControlPanel : Cette branche gère tous les paramètres du panneau de configuration.\n/keyboard/layout : Configuration …","date":1582725495,"description":"","lastmod":"2020-02-26T13:58:15Z","objectID":"52121a440182a5d04b84298605533a17","permalink":"https://example.com/system/registres/","publishdate":"2020-02-26T13:58:15Z","title":"Registre"},{"content":"","date":1580656493,"description":"","lastmod":"2020-02-02T15:14:53Z","objectID":"d2138a707ab49e68758799355e1e7022","permalink":"https://example.com/web/html/","publishdate":"2020-02-02T15:14:53Z","title":"HTML"},{"content":"CTF Formatif Sujets couvert  Systeme Reseau Web  ","date":1508426775,"description":"","lastmod":"2019-10-26T15:26:15Z","objectID":"3976528693a0108357f4928017600865","permalink":"https://example.com/","publishdate":"2018-11-23T15:26:15Z","title":"Home"},{"content":"        var search = instantsearch({ indexName: \u0026#39;hugo-demo-techdoc\u0026#39;, searchClient: algoliasearch( \u0026#39;7W4SAN4PLK\u0026#39;, \u0026#39;cbf12a63ff72d9c5dc0c10c195cf9128\u0026#39; ), routing: true, }); const renderHits = (renderOptions, isFirstRender) = { const { hits } = renderOptions; document.querySelector(\u0026#39;#hits\u0026#39;).innerHTML = ` ${hits .map( item = `${ item.title }${ dayjs(item.lastmod).format(\u0026#34;YYYY/MM/DD\u0026#34;) } - ${ item.description ? item.description : item.content.length  200 ? item.content.substring( 0, 200 ) + \u0026#39;...\u0026#39; : item.content }\n` ) .join(\u0026#39;\u0026#39;)} `; }; const customHits = instantsearch.connectors.connectHits( renderHits ); search.addWidgets([ instantsearch.widgets.searchBox({ container: \u0026#39;#searchbox\u0026#39;, showReset: false, }), instantsearch.widgets.stats({ container: \u0026#39;#stats\u0026#39;, }), customHits({ container: document.querySelector(\u0026#39;#hits\u0026#39;), }), instantsearch.widgets.pagination({ container: \u0026#39;#pagination\u0026#39;, maxPages: 20, }) ]); search.start();  ","date":1508426775,"description":"","lastmod":"2017-10-19T15:26:15Z","objectID":"4953bf99d7018c161b1b361cb25f1331","permalink":"https://example.com/search/","publishdate":"2017-10-19T15:26:15Z","title":"Rechercher"}]